Revit 2027 API
GenericZone.GetDomainData Method
 Gets the domain data for the generic zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GenericZoneDomainData GetDomainData()
Public Function GetDomainData As GenericZoneDomainData
public:
GenericZoneDomainData^ GetDomainData()
member GetDomainData : unit -> GenericZoneDomainData
Return Value
GenericZoneDomainData
 Returns a pointer to the base class for specific domain requirements for the generic zone.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace